In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('../cleaning-data-python-data-playbook/artwork_data.csv', low_memory=False)
df.head(2)

,id,accession_number,artist,artistRole,artistId,title,dateText,medium,creditLine,year,acquisitionYear,dimensions,width,height,depth,units,inscription,thumbnailCopyright,thumbnailUrl,url
0,1035,A00001,"Blake, Robert",artist,38,A Figure Bowing before a Seated Old Man with h...,date not known,"Watercolour, ink, chalk and graphite on paper....",Presented by Mrs John Richmond 1922,NaN,1922.0,support: 394 x 419 mm,394,419,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-a-fi...
1,1036,A00002,"Blake, Robert",artist,38,"Two Drawings of Frightened Figures, Probably f...",date not known,Graphite on paper,Presented by Mrs John Richmond 1922,NaN,1922.0,support: 311 x 213 mm,311,213,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-two-...

In [7]:
df.shape

(69201, 20)

In [8]:
df.dropna().shape  # woah, we eliminated almost all the rows. equivalent to df.dropna(how='any')

(164, 20)

In [9]:
# drop all records where any column has a null value
df.dropna(how='any').shape

(164, 20)

In [10]:
# drop all records where all the row values are a null value
df.dropna(how='all').shape

(69201, 20)

In [12]:
# set threshhold of number of na values in a row
df.dropna(thresh=15).shape  # drop all rows where at least 15 columns have value of na

(66379, 20)

In [13]:
# drop where any of a list of columns are na
df.dropna(subset=['year','acquisitionYear']).shape

(63781, 20)

In [14]:
# drop where all columns of a list of columns are na
df.dropna(subset=['year','acquisitionYear'], how='all').shape

(69198, 20)

In [15]:
# to modify the source dataframe, use inplace=True argument
df.dropna(subset=['year','acquisitionYear'],inplace=True)
df.shape

(63781, 20)